// Введение

/*
Си является компилируемым языком, а это значит,
что компилятор транслирует исходный код на Си в исполняемый файл,
который содержит набор машинных инструкций. 
Но разные платформы имеют свои особенности, 
поэтому скомпилированные программы нельзя просто перенести
с одной платформы на другую и там уже запустить. 
Однако на уровне исходного кода программы на Си обладают переносимостью, 
а наличие компиляторов, библиотек и инструментов разработки 
почти под все распространенные платформы позволяет компилировать 
один и тот же исходный код на Си в приложения под эти платформы.
*/

/*
Компиляторы:
    - GCC от проекта GNU
    - Clang
 */

